package main

import "fmt"

// Создай CLI-программу, которая:
// Объявляет struct Product с полями ID, Name, Price, Quantity, Category.
// Создаёт slice из 5 товаров.
// Выводит все товары через for range.
// Находит товар по ID.
// Фильтрует товары дороже $100.
// Находит самый дорогой и самый дешёвый товар.
// Считает общую стоимость склада (Price * Quantity).
// Группирует товары по категориям через map[string][]Product.
// Подсчитывает количество товаров в каждой категории через map[string]int.
// Добавляет новый товар и удаляет существующий по ID.
// Условия: Используй отдельные функции для операций. Не используй сторонние библиотеки.
func main() {
}
